;XCOM 2 relies on per-object config settings like the one below to link X2DataTemplate objects with their associated localized text

[Guardsman X2SoldierClassTemplate]
DisplayName="<font color='#395f0b'>帝国卫队</font>"
ClassSummary="帝国卫队，也被称为“枪炮之墙”，是人类帝国武装力量的主体。卫队士兵的唯一职责就是光荣地为帝皇战死，而政委会确保他们履行这项职责，懦夫或逃兵往往会被立即处决。"
LeftAbilityTreeTitle="火力"
RightAbilityTreeTitle="支援"
AbilityTreeTitles[0]="火力覆盖"
AbilityTreeTitles[1]="战斗支援"
AbilityTreeTitles[2]="忠嗣学院"

RandomNickNames[0]="Jack"
RandomNickNames[1]="Ward"
RandomNickNames[2]="卡塔昌"
RandomNickNames[3]="卡迪安"
RandomNickNames[4]="Shields"
RandomNickNames[5]="Wests"
RandomNickNames[6]="Midas"
RandomNickNames[7]="Mesh"
RandomNickNames[8]="Storm"
RandomNickNames[9]="Guard-Bro"
RandomNickNames[10]="Grunt"
RandomNickNames[11]="Monster"
RandomNickNames[12]="Blacks"
RandomNickNames[13]="Teach"
RandomNickNames[14]="Astra"
RandomNickNames[15]="Aceria"
RandomNickNames[16]="Chief"
RandomNickNames[17]="Morgue"
RandomNickNames[18]="Militarum"
RandomNickNames[19]="Stretch"
RandomNickNames[20]="Thumper"
RandomNickNames[21]="Werewolf"
RandomNickNames_Male[0]="Dusty"
RandomNickNames_Male[1]="Dutch"
RandomNickNames_Male[2]="Husker"
RandomNickNames_Male[3]="Slick"
RandomNickNames_Male[4]="Pops"
RandomNickNames_Male[5]="Chuckles"
RandomNickNames_Male[6]="Dingus"
RandomNickNames_Male[7]="Maniac"
RandomNickNames_Male[8]="Knuckles"
RandomNickNames_Male[9]="Walrus"
RandomNickNames_Female[0]="Bubbles"
RandomNickNames_Female[1]="Gadget"
RandomNickNames_Female[2]="Giggles"
RandomNickNames_Female[3]="Mango"
RandomNickNames_Female[4]="Pepper"
RandomNickNames_Female[5]="Aunty"
RandomNickNames_Female[6]="Goodnight"
RandomNickNames_Female[7]="Medusa"
RandomNickNames_Female[8]="Sugar"

	
[GuardLethalShot X2AbilityTemplate]
LocFriendlyName="火力覆盖"
LocLongDescription="<Ability:ClassName/>的<font color='#ff3206'>未命中</font>射击仍可造成<font color='#0bff9b'>1</font>点伤害。"
LocHelpText="<Ability:ClassName/>的<font color='#ff3206'>未命中</font>射击仍可造成<font color='#0bff9b'>1</font>点伤害。"
LocFlyOverText="火力覆盖"
LocPromotionPopupText="<Bullet/>类似于<font color='#0bff9b'>枪托</font>的保底伤害。<br/>"

[GuardKrak X2AbilityTemplate]
LocFriendlyName="无尽雷区"
LocLongDescription="获得<font color='#0bff9b'>1</font>个感应地雷，并为自身携带的感应地雷提供额外<font color='#0bff9b'>1</font>使用次数。"
LocFlyOverText="无尽雷区"
LocPromotionPopupText="<Bullet/>即使未携带也可使用感应地雷。<br/><Bullet/>若携带感应地雷则额外获得<font color='#0bff9b'>1</font>使用次数。<br/>"

[GuardDeathWatch X2AbilityTemplate]
LocFriendlyName="戒心永存"
LocLongDescription="<Ability:ClassName/>会根据视野内的敌人数量使自身获得防御加成，并对靠近的敌人进行<font color='#0bff9b'>反应射击</font>。"
LocHelpText="<Ability:ClassName/>会根据视野内的敌人数量使自身获得防御加成，并对靠近的敌人进行<font color='#0bff9b'>反应射击</font>。"
LocFlyOverText="戒心永存"
LocPromotionPopupText="<Bullet/>视野内的每名敌人使自身获得<font color='#0bff9b'>5</font>点防御加成，最高可获<font color='#0bff9b'>25</font>点。<br/><Bullet/>并向<font color='#0bff9b'>10</font>格内进行移动的任意敌人进行<font color='#0bff9b'>反应射击</font>。<br/>"

[GuardKasrBuff X2AbilityTemplate]
LocFriendlyName="至诚之钢"
LocLongDescription="提高<font color='#0bff9b'>5</font>点防御、闪避、意志，以及<font color='#0bff9b'>2</font>点生命值。"
LocHelpText="提高<font color='#0bff9b'>5</font>点防御、闪避、意志，以及<font color='#0bff9b'>2</font>点生命值。"
LocFlyOverText="至诚之钢"
LocPromotionPopupText="<Bullet/>简单直接的属性提升，能够有效的提高容错率。<br/>"

[GuardScionBuff X2AbilityTemplate]
LocFriendlyName="卫星锁定"
LocLongDescription="提高<font color='#0bff9b'>5</font>点命中，并获取<font color='#0bff9b'>小队视野</font>特长。"
LocHelpText="提高<font color='#0bff9b'>5</font>点命中，并获取<font color='#0bff9b'>小队视野</font>特长。"
LocFlyOverText="卫星锁定"
LocPromotionPopupText="<Bullet/><font color='#0bff9b'>小队视野</font>：倘若沿途未受障碍物阻挡，可瞄准位于任何队友视野内的敌人。<br/>"

[GuardFervor X2AbilityTemplate]
LocFriendlyName="战斗热诚"
LocLongDescription="立即获得<font color='#0bff9b'>1</font>额外行动点，并在当前回合额外提高<font color='#0bff9b'>5</font>点移动力。"
LocHelpText="立即获得<font color='#0bff9b'>1</font>额外行动点，并在当前回合额外提高<font color='#0bff9b'>5</font>点移动力。"
LocFlyOverText="战斗热诚"
LocPromotionPopupText="<Bullet/>这是一项废除技能，并未有所找到。<br/>"

[FullKit X2AbilityTemplate]
LocFriendlyName="充分准备"
LocLongDescription="自身所携带的手榴弹提供额外<font color='#0bff9b'>1</font>使用次数。"
LocHelpText="自身所携带的手榴弹提供额外<font color='#0bff9b'>1</font>使用次数。"
LocFlyOverText="充分准备"
LocPromotionPopupText="<Bullet/>这是一项废除技能，并未有所找到。<br/>"

[GuardChainShot X2AbilityTemplate]
LocFriendlyName="连环追击"
LocLongDescription="以<font color='#ff3206'>-10</font>命中进行首轮射击。若成功击中目标，则再以<font color='#ff3206'>-5</font>的命中进行追加射击。"
LocHelpText="以<font color='#ff3206'>-10</font>命中进行首轮射击。若成功击中目标，则再以<font color='#ff3206'>-5</font>的命中进行追加射击。"
LocFlyOverText="连环追击"
LocPromotionPopupText="<Bullet/>这是一项废除技能，并未有所找到。<br/>"

[GuardPistol X2AbilityTemplate]
LocFriendlyName="手枪精训"
LocLongDescription="同时获取<font color='#0bff9b'>快射拔枪</font>和<font color='#0bff9b'>雷霆之手</font>特长。"
LocHelpText="同时获取<font color='#0bff9b'>快射拔枪</font>和<font color='#0bff9b'>雷霆之手</font>特长。"
LocFlyOverText="手枪精训"
LocPromotionPopupText="<Bullet/><font color='#0bff9b'>快射拔枪</font>：手枪射击不会结束回合，可在射击后移动或一回合内射击多次。<br/><Bullet/><font color='#0bff9b'>雷霆之手</font>：本次手枪射击不消耗行动点。<br/><Bullet/>冷却时间：<font color='#0bff9b'>3</font>回合<br/>"

[GuardGear X2AbilityTemplate]
LocFriendlyName="星界军生存套装"
LocLongDescription="使<Ability:ClassName/>能够对火焰以及毒气免疫。"
LocHelpText="使<Ability:ClassName/>能够对火焰以及毒气免疫。"
LocFlyOverText="星界军生存套装"

[GuardGear X2SoldierAbilityUnlockTemplate]
DisplayName="帝国卫队:精工防护"
Summary="使<Ability:ClassName/>能够对火焰以及毒气免疫。"

[GuardInthezone X2AbilityTemplate]
LocFriendlyName="渐入佳境"
LocLongDescription="每当使用主武器击杀敌人，都会返还行动点。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocHelpText="每当使用主武器击杀敌人，都会返还行动点。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocFlyOverText="渐入佳境"
LocPromotionPopupText="<Bullet/>换皮版<font color='#0bff9b'>连环杀戮</font>。<br/>"

[GuardRapidFire X2AbilityTemplate]
LocFriendlyName="连环射击"
LocLongDescription="连续朝一名敌人射击两次，每次射击受到<font color='#ff3206'>-15</font>的命中减益。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocHelpText="连续朝一名敌人射击两次，每次射击受到<font color='#ff3206'>-15</font>的命中减益。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocFlyOverText="连环射击"
LocPromotionPopupText="<Bullet/>换皮版<font color='#0bff9b'>速射</font>。<br/>"

[GuardRunAndGun X2AbilityTemplate]
LocFriendlyName="肾上腺素"
LocLongDescription="立即获得<font color='#0bff9b'>1</font>额外行动点。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocHelpText="立即获得<font color='#0bff9b'>1</font>额外行动点。<br/>冷却时间：<font color='#0bff9b'>4</font>回合"
LocFlyOverText="肾上腺素"
LocPromotionPopupText="<Bullet/>换皮版<font color='#0bff9b'>奔袭战术</font>。<br/>"

[GuardSquaddieDummy X2AbilityTemplate]
LocFriendlyName="多才多艺"
LocLongDescription="<Ability:ClassName/>可使用多种武器装备，包括突击步枪、霰弹枪以及狙击步枪。"
LocHelpText="<Ability:ClassName/>可使用多种武器装备，包括突击步枪、霰弹枪以及狙击步枪。"
LocFlyOverText="多才多艺"
LocPromotionPopupText="<Bullet/>灵活的选择武器，可运用多样化的战术。<br/>"

[GuardTacticalSense X2AbilityTemplate]
LocFriendlyName="严阵以待"
LocLongDescription="视野内的每名敌人使自身获得<font color='#0bff9b'>5</font>点防御加成，最高可获<font color='#0bff9b'>25</font>点。"
LocHelpText="视野内的每名敌人使自身获得<font color='#0bff9b'>5</font>点防御加成，最高可获<font color='#0bff9b'>25</font>点。"
LocFlyOverText="严阵以待"
LocPromotionPopupText="<Bullet/>视野内的每名敌人使自身获得<font color='#0bff9b'>5</font>点防御加成，最高可获<font color='#0bff9b'>25</font>点。<br/>"
